mtosi_1.1/xml/notifications/vendorNotification.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:nt1="vendor.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="vendor.v1 ../vendorSchema/vendorDefinitions.xsd tmf854.v1 ../../xsd/common/header.xsd tmf854.v1 ../../xsd/interfaces/InventoryRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <header tmf854Version="1.0">
      <activityName>notify</activityName>
      <msgName>notify</msgName>
      <msgType>NOTIFICATION</msgType>
      <senderURI>/MTOSI/EMS01</senderURI>
      <destinationURI>/MTOSI/InventoryOS</destinationURI>
      <communicationPattern>Notification</communicationPattern>
      <communicationStyle>MSG</communicationStyle>
      <timestamp>20051004140305</timestamp>
    </header>
  </soap:Header>
  <soap:Body>
    <notify tmf854Version="1.0" extAuthor="JM" extVersion="1.01a">
      <topic>Inventory</topic>
      <message>
        <VendorNotification>
          <notificationId>0001250</notificationId>
          <vendorNotificationType>VendorNotificationA</vendorNotificationType>
          <vendorExtensions>
            <nt1:NotificationA>
              <nt1:attribute1>value1</nt1:attribute1>
              <nt1:attribute2>
                <nt1:attribute2-1>21</nt1:attribute2-1>
                <nt1:attribute2-1>22</nt1:attribute2-1>
              </nt1:attribute2>
              <nt1:attribute3>
                <nt1:attribute3-1>false</nt1:attribute3-1>
                <nt1:attribute3-2>string</nt1:attribute3-2>
              </nt1:attribute3>
            </nt1:NotificationA>
          </vendorExtensions>
        </VendorNotification>
      </message>
    </notify>
  </soap:Body>
</soap:Envelope>
